# reference_data.py
from typing import List, Dict

# === СПРАВОЧНИК: Минимальное кол-во клиентов в канале ===

MIN_CLIENTS = {
    ("ММБ МКК", "ММБ"): 30,
    ("ЦКР", "ММБ"): 30,
    ("КМ МС", "ММБ"): 30,
    ("КМ ККСБ", "КСБ"): 20,
    ("КМ и ТКМ СКМ", "СКМ"): 5,
    ("КМ и ТКМ РГС", "РГС"): 1,
    ("DTO", "KeyClients"): 1,
}

# === СПРАВОЧНИК: Цена и себестоимость каналов продаж ===

CHANNEL_COSTS = {
    ("DTO", "KeyClients", "Коробка"): 3144.02,
    ("DTO", "KeyClients", "Кастом"): 47000.41,

    ("КМ ККСБ", "КСБ", "Коробка"): 13270.7,
    ("КМ ККСБ", "КСБ", "Кастом"): 39653.3,

    ("КМ и ТКМ СКМ", "СКМ", "Коробка"): 3128.07,
    ("КМ и ТКМ СКМ", "СКМ", "Кастом"): 21281.96,

    ("КМ и ТКМ РГС", "РГС", "Коробка"): 3179.15,
    ("КМ и ТКМ РГС", "РГС", "Кастом"): 21716.15,

    ("ММБ МКК", "ММБ", "Коробка"): 1373.62,
    ("ММБ МКК", "ММБ", "Кастом"): 26660.72,

    ("ЦКР", "ММБ", "Коробка"): 1313.63,
    ("ЦКР", "ММБ", "Кастом"): 6448.67,

    ("КМ МС", "ММБ", "Коробка"): 2599.29,
    ("КМ МС", "ММБ", "Кастом"): 48109.29,
}


SEGMENT_CHANNELS = {
    "ММБ": ["ММБ МКК", "ЦКР", "КМ МС"],
    "СКМ": ["КМ и ТКМ СКМ"],
    "РГС": ["КМ и ТКМ РГС"],
    "КСБ": ["КМ ККСБ"],
    "KeyClients": ["DTO"],
}

# Необязательные дефолты на случай, если пользователь не задал долю и Кприб
SEGMENT_DOLYA_DEFAULT = {"KeyClients": 15.0, "КСБ": 12.0, "СКМ": 10.0, "РГС": 8.0, "ММБ": 6.0}
SEGMENT_KPRIB_DEFAULT = {"KeyClients": 30.0, "КСБ": 25.0, "СКМ": 20.0, "РГС": 18.0, "ММБ": 15.0}
